name: "antispoof"
platform: "tensorrt_plan"
max_batch_size: 32
default_model_filename: "model.plan"

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, 80, 80]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [2]
  }
]

dynamic_batching {
  preferred_batch_size: [1, 2, 4, 8, 16, 32]
  max_queue_delay_microseconds: 3000
}

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
