name: "realesrgan"
platform: "tensorrt_plan"
max_batch_size: 8
default_model_filename: "model.plan"

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, -1, -1]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [3, -1, -1]
  }
]

dynamic_batching {
  preferred_batch_size: [1, 2, 4, 8]
  max_queue_delay_microseconds: 5000
}

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
